{
  "id": "ezooCYfXtKYVuRHDVgRCZIV9",
  "type": "retail-zoo",
  "name": "E-ZOO",
  "subscriptionName": "E-ZOO Premium",
  "subscriptionPrice": "₴249",
  "colorScheme": "green",
  "benefits": [
    {
      "title": "4 безкоштовні доставки на місяць",
      "description": "Замовляйте онлайн без переплат за доставку до 4 разів на місяць. Зручно для регулярних покупок та економії часу без додаткових витрат.",
      "icon": "Package"
    },
    {
      "title": "+2% кешбеку",
      "description": "Отримуйте додаткові 2% кешбеку на всі покупки в E-ZOO. Більше купуєте — більше повертаєте. Дозволяє регулярно накопичувати додаткову вигоду з кожного чеку.",
      "icon": "BadgePercent"
    },
    {
      "title": "Унікальні знижки та пропозиції",
      "description": "Доступ до спеціальних акцій та персональних пропозицій лише для учасників E-ZOO Premium. Дозволяє купувати улюблені товари за ще вигіднішими цінами та отримувати більше бонусів щомісяця.",
      "icon": "Tags"
    }
  ],
  "services": [
       {
      "id": "kroha",
      "name": "Kroha",
      "shortDescription": "Батьківський контроль для захисту дітей",
      "fullDescription": "Платформа кіно та телебачення з контентом від українських та зарубіжних студій і телеканалів у HD якості",
      "logo": "/logos/kroha.png"
    },
    {
      "id": "tysha",
      "name": "Tysha",
      "shortDescription": "Ваш провідник до внутрішнього спокою та ментального здоров'я",
      "fullDescription": "Унікальний шлях до релаксації та гармонії зі своїм внутрішнім світом. На вас чекають практики для заспокоєння розуму, покращення якості сну та зміцнення психологічної стійкості.",
      "logo": "/logos/tysha.png"
    },
    {
      "id": "nanohabits",
      "name": "Nanohabits",
      "shortDescription": "Побудуйте краще життя — одна маленька звичка за раз",
      "fullDescription": "Покращуйте кожен аспект свого життя — здоров’я, розум, стосунки, зростання, роботу та спосіб життя — за допомогою найбільшої у світі бібліотеки науково підтверджених звичок і власного тренера на основі ШІ",
      "logo": "/logos/nanohabits.png"
    }
  ]
}