{
  "id": "otpbankCk0QzE2D1pb9VZ78zAdA",
  "type": "bank",
  "name": "OTP Bank",
  "subscriptionName": "OTP Premium",
  "subscriptionPrice": "₴399",
  "colorScheme": "green",
  "benefits": [
    {
      "title": "Додаткові 2% до ставки за депозитом",
      "description": "Отримуйте підвищену дохідність за строковими депозитами в гривні. Додатковий відсоток нараховується автоматично в межах преміум тарифу та дозволяє збільшити прибуток без зміни умов розміщення коштів.",
      "icon": "TrendingUp"
    },
    {
      "title": "Знижка до 20% на міжнародні перекази",
      "description": "Знижка на комісії за міжнародні перекази, зокрема SWIFT. Дозволяє зменшити витрати на регулярні платежі за кордон — для особистих переказів, оплати послуг або підтримки рідних.",
      "icon": "Banknote"
    },
    {
      "title": "Пріоритетна підтримка 24/7",
      "description": "Цілодобова пріоритетна підтримка без очікування в черзі. Звернення обробляються швидше, а консультації надають досвідчені спеціалісти банку в чаті або телефоном.",
      "icon": "Phone"
    }
  ],
  "services": [
    {
      "id": "silpo",
      "name": "Сільпо",
      "shortDescription": "Гіпермаркет продуктів #1 в Україні",
      "fullDescription": "Доставка продуктів, дитячих товарів, готової їжі з супермаркетів «Сільпо». Замовити продукти і їжу можна всього за декілька клаців. Діє оплата карткою при доставці і в застосунку.",
      "logo": "/logos/silpo.png"
    },
    {
      "id": "KaterynaCare",
      "name": "Kateryna Care",
      "shortDescription": "Тривожна кнопка в твоєму телефоні",
      "fullDescription": "Непідписка на застосунок, який за натиском кнопки викликає одну з 1500 груп мобільного реагування, коли ти відчуваєш небезпеку. KATERYNA завжди на твоїй стороні. Ми забезпечимо тобі фізичний захист або відвеземо в безпечне місце.",
      "logo": "/logos/kateryna.png"
    },
    {
      "id": "VPNUnlimited",
      "name": "VPN Unlimited",
      "shortDescription": "Найкращий приватний та безпечний VPN",
      "fullDescription": "Насолоджуйтесь неперевершеною безпекою та абсолютною свободою в інтернеті на своєму пристрої з будь-якої точки світу",
      "logo": "/logos/vpn-unlim.png"
    }
  ],
  "partnerOffers": [
    {
      "slug": "rozetka",
      "name": "Rozetka",
      "offer": "Кешбек 10%",
      "type": "cashback",
      "logo": "/partners/rozetka.png",
      "description": "Отримуйте кешбек 10% при покупках в Rozetka з Premium підпискою. Бонуси автоматично нараховуються на ваш рахунок протягом 24 годин після покупки."
    },
    {
      "slug": "comfy",
      "name": "Comfy",
      "offer": "Кешбек 8%",
      "type": "cashback",
      "logo": "/partners/comfy.png",
      "description": "Отримуйте кешбек 8% при покупках в Comfy з Premium підпискою. Бонуси автоматично нараховуються на ваш рахунок протягом 24 годин після покупки."
    },
    {
      "slug": "atb",
      "name": "АТБ",
      "offer": "Кешбек 12%",
      "type": "cashback",
      "logo": "/partners/atb.png",
      "description": "Отримуйте кешбек 12% при покупках в АТБ з Premium підпискою. Бонуси автоматично нараховуються на ваш рахунок протягом 24 годин після покупки."
    },
    {
      "slug": "varus",
      "name": "Varus",
      "offer": "Знижка 10%",
      "type": "cashback",
      "logo": "/partners/varus.png",
      "description": "Отримуйте кешбек 12% при покупках в Varus з Premium підпискою. Бонуси автоматично нараховуються на ваш рахунок протягом 24 годин після покупки."
    },
    {
      "slug": "apteka",
      "name": "Аптека Низьких Цін",
      "offer": "Знижка 20%",
      "type": "discount",
      "logo": "/partners/anc.png",
      "description": "Отримуйте знижку 20% на всі товари в АНЦ з Premium підпискою. Знижка застосовується автоматично при оплаті карткою партнера."
    }
  ]
}