{
  "id": "varusivNJnLxVqBBp07RW3BGp",
  "type": "retail-food",
  "name": "Varus",
  "subscriptionName": "Varus Premium",
  "subscriptionPrice": "₴149",
  "colorScheme": "green",
  "benefits": [
    {
      "title": "4 безкоштовні доставки на місяць",
      "description": "Замовляйте продукти онлайн без переплат за доставку до 4 разів на місяць. Зручно для регулярних покупок та економії часу без додаткових витрат.",
      "icon": "Package"
    },
    {
      "title": "+2% кешбеку",
      "description": "Отримуйте додаткові 2% кешбеку на всі покупки в VARUS. Більше купуєте — більше повертаєте. Дозволяє регулярно накопичувати додаткову вигоду з кожного чеку.",
      "icon": "BadgePercent"
    },
    {
      "title": "Унікальні знижки та пропозиції",
      "description": "Доступ до спеціальних акцій та персональних пропозицій лише для учасників VARUS Premium. Дозволяє купувати улюблені товари за ще вигіднішими цінами та отримувати більше бонусів щомісяця.",
      "icon": "Tags"
    }
  ],
  "services": [
       {
      "id": "kstv",
      "name": "КиївстарТБ",
      "shortDescription": "Кіно, мультики, серіали та шоу українською мовою",
      "fullDescription": "Платформа кіно та телебачення з контентом від українських та зарубіжних студій і телеканалів у HD якості",
      "logo": "/logos/kstv.png"
    },
    {
      "id": "gramaro",
      "name": "Gramaro",
      "shortDescription": "Вивчати англійську легко та просто",
      "fullDescription": "Виконуйте практичні вправи кожного дня та вдосконалюйте свої знання. В додатку зібрано більш ніж 60 важливих правил английскої мови",
      "logo": "/logos/gramaro.png"
    },
    {
      "id": "ninjafit",
      "name": "NinjaFit",
      "shortDescription": "Трекер калорій на базі штучного інтелекту",
      "fullDescription": "Незалежно від того, чи хочете ви схуднути, наростити м'язи чи підтримувати збалансований спосіб життя, Ninja Fit пропонує персоналізовані інструменти, які допоможуть вам досягти ваших цілей.",
      "logo": "/logos/ninjafit.png"
    },
    {
      "id": "chatmnd",
      "name": "ChatMind",
      "shortDescription": "Швидкий та зручний спосіб вивчати нове",
      "fullDescription": "Обирайте теми, проходьте швидки уроки, відстежуйте прогресс та ставайте кращою версією себе",
      "logo": "/logos/chatmind.png"
    },
    {
      "id": "onlinefitness",
      "name": "Online Fitness",
      "shortDescription": "Досягайте своїх фітнес-цілей в будь-який зручний час",
      "fullDescription": "Online Fitness пропонує широкий вибір онлайн-курсів, які підходять для будь-якого рівня підготовки: від легкої розминки, до інтенсивних тренувань",
      "logo": "/logos/online-fitness.png"
    }
  ],
  "partnerOffers": [
    {
      "slug": "rozetka",
      "name": "Rozetka",
      "offer": "Кешбек 10%",
      "type": "cashback",
      "logo": "/partners/rozetka.png",
      "description": "Отримуйте кешбек 10% при покупках в Rozetka з Varus Premium підпискою. Бонуси автоматично нараховуються на ваш рахунок протягом 24 годин після покупки."
    },
    {
      "slug": "comfy",
      "name": "Comfy",
      "offer": "Кешбек 8%",
      "type": "cashback",
      "logo": "/partners/comfy.png",
      "description": "Отримуйте кешбек 8% при покупках в Comfy з Varus Premium підпискою. Бонуси автоматично нараховуються на ваш рахунок протягом 24 годин після покупки."
    },
    {
      "slug": "socar",
      "name": "SOCAR",
      "offer": "Знижка 2 грн/л пального",
      "type": "discount",
      "logo": "/partners/socar.png",
      "description": "Отримуйте знижку 2 грн на кожен літр пального на АЗС мережі SOCAR з Premium підпискою. Знижка застосовується автоматично при оплаті карткою партнера"
    },
    {
      "slug": "pumb",
      "name": "PUMB",
      "offer": "Додаткова категория кешбеку",
      "type": "cashback",
      "logo": "/partners/pumb.png",
      "description": "Відкрийте додаткову категорію кешбеку виключно для користувачів з Premium підпискою."
    },
    {
      "slug": "anc",
      "name": "Моя Аптека",
      "offer": "Знижка 20%",
      "type": "discount",
      "logo": "/partners/anc.png",
      "description": "Отримуйте знижку 20% на всі товари в Моя Аптека з Varus Premium підпискою. Знижка застосовується автоматично при оплаті карткою партнера."
    }
  ]
}
