export interface InsuranceProduct {
  title: string
  desc: string
  price: string
  details: string
}

export const insuranceByType: Record<string, InsuranceProduct[]> = {
  bank: [
    {
      title: 'Кібербезпека',
      desc: 'Захист від шахрайства',
      price: 'включено в тариф',
      details: 'Захист ваших коштів на картці від шахрайства в інтернеті, банкоматах та інших обманних дій третіх осіб',
    },
    {
      title: 'Захист здоровʼя',
      desc: 'Захист від нещасного випадку',
      price: 'включено в тариф',
      details: 'Захист у разі травми, втрати працездатності або смерті внаслідок нещасного випадку (до 25 000 грн/рік)',
    },
    // старое для банков
   /* {
      title: 'Страхування відміни подорожі або заходу',
      desc: 'Захист від непередбачених обставин',
      price: 'включено в тариф',
      details: 'Отримайте повернення до 70% від вартості подорожі чи заходу при скасуванні через хворобу, нещасний випадок або інші форс-мажорні обставини.',
    },
    {
      title: 'Туристична страховка',
      desc: 'Медичне страхування за кордоном',
      price: 'включено в тариф',
      details: 'Повне медичне страхування під час подорожей за кордон. Покриття до €50,000 на медичні витрати, включаючи госпіталізацію, екстрену допомогу та репатріацію. Працює в усіх країнах світу.',
    },
    {
      title: 'Захист домашніх тварин',
      desc: 'Медичне страхування для улюбленців',
      price: 'включено в тариф',
      details: 'Покриття форс-мажорних витрат на ветеринара. Сума компенсації до 30 000 грн і залежить від типу страхового випадку.',
    }, */
  ],
  operator: [
    {
      title: 'Захист здоровʼя',
      desc: 'Захист від нещасного випадку',
      price: 'включено в тариф',
      details: 'Захист у разі травми, втрати працездатності або смерті внаслідок нещасного випадку (до 25 000 грн/рік)',
    }
    // старое для банков
   /*
    {
      title: 'Страхування телефону',
      desc: 'Захист від пошкодження та крадіжки',
      price: 'включено в тариф',
      details: 'Повне покриття вартості ремонту або заміни вашого смартфона при пошкодженні, крадіжці або втраті. Діє на території України.',
    },
    {
      title: 'Кіберстрахування',
      desc: 'Захист від шахрайства онлайн',
      price: 'включено в тариф',
      details: 'Компенсація до 50 000 грн у випадку фінансового шахрайства, фішингу або крадіжки особистих даних.',
    },*/
  ],
  'gas-station': [
    {
      title: 'Допомога при блокуванні авто або втраті ключів',
      desc: '',
      price: 'включено у тариф',
      details: 'Організація та покриття витрат на вирішення ситуації, щоб ви могли швидко повернутися до поїздки.',
    },
    {
      title: 'Евакуація авто у разі поломки',
      desc: '',
      price: 'включено в тариф',
      details: 'Покриття витрат на транспортування автомобіля до найближчого сервісу у разі раптової несправності.',
    },
  ],
  'retail-food': [
    {
      title: 'Захист здоровʼя',
      desc: 'Захист від нещасного випадку',
      price: 'включено в тариф',
      details: 'Захист у разі травми, втрати працездатності або смерті внаслідок нещасного випадку (до 25 000 грн/рік)',
    },
    /*
    {
      title: 'Страхування домашніх улюбленців',
      desc: '',
      price: 'включено у тариф',
      details: 'Компенсація у разі хвороби або нещасного випадку з вашим улюбленцем. Допомагає покрити витрати на лікування та ветеринарні послуги, зменшуючи непередбачені витрати та забезпечуючи спокій власнику.',
    }
    */
  ],
    'retail-zoo': [
    {
      title: 'Страхування домашніх улюбленців',
      desc: '',
      price: 'включено у тариф',
      details: 'Компенсація у разі хвороби або нещасного випадку з вашим улюбленцем. Допомагає покрити витрати на лікування та ветеринарні послуги, зменшуючи непередбачені витрати та забезпечуючи спокій власнику.',
    }
  ],
  pharmacy:[
    {
      title: 'Страхування здоровʼя',
      desc: '',
      price: 'включено у тариф',
      details: 'у разі захворювання чи травми отримуйте страхову виплату на лікування та необхідні медикаменти', 
    }
  ]
}

export function getInsuranceShortList(type: string): string[] {
  const insurance = insuranceByType[type] || insuranceByType.bank
  return insurance.map(item => item.title)
}

export function getInsuranceSummary(type: string): string {
  switch (type) {
    case 'bank':
        return 'Страхування від шахраїв та від нещасного випадку'
      /* return 'Страхування подорожей, заходів і домашніх улюбленців' */
    case 'operator':
      return 'Страхування від нещасного випадку'
     /* return 'Страхування телефону, кібербезпека та захист даних'*/
    case 'gas-station':
      return 'Допомога з доступом та евакуацією авто'
    case 'retail-food':
      return 'Страхування від нещасного випадку'
      /* return 'Страхування домашніх улюбленців' */
    case 'retail-zoo':
      return 'Страхування домашніх улюбленців'
    case 'pharmacy':
      return 'Комплексне страхування здоровʼя'
    default:
      return 'Комплексне страхування'
  }
}